Autodesk.Revit.DB.InternalDefinition.GetLocalizedName(Autodesk.Revit.ApplicationServices.LanguageType)
Getter for: The localized user-visible name of the parameter.
language:
A specified language.
Returns:
A reference to the parameter's name.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.InternalDefinition.SetAllowVaryBetweenGroups(Autodesk.Revit.DB.Document,System.Boolean)
Whether or not the parameter values can vary across group members.
Remarks:
When a parameter is set to not vary between groups Revit will automatically align the parameter values
of any elements that actually varied between group instances.
document:
The document of this parameter.
allowVaryBetweenGroups:
Whether this parameter should be allowed to vary between groups.
Returns:
The ids of elements that were updated to align the values between groups.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This parameter does not support the specified value of allowVaryBetweenGroups.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.InternalDefinition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.InternalDefinition.Id
The id of the parameter.
Since:
2017

Autodesk.Revit.DB.InternalDefinition.VariesAcrossGroups
Whether or not the parameter values can vary across group members.
True if the values of this parameter can vary across the related members of group instances.  False
if the values will be consistent across the related members in group instances.
Since: 2014

Autodesk.Revit.DB.InternalDefinition.Visible
Indicates if the parameter is visible in the Autodesk Revit user interface.
Remarks: The visible property controls whether a shared parameter is hidden from the user. This
is useful if you wish to add data to an element that is only meaningful to your application and
not to the user. This value can only be set when the shared parameter definition is created.

Autodesk.Revit.DB.InternalDefinition.BuiltInParameter
Tests whether this definition identifies a built-in parameter or not.
Remarks:  For a build-in parameter this property equals one of the BuiltInParameter enumerated values.
For custom-defined parameters, such as shared, global, or family parameters the value is always BuiltInParameter.INVALID.

Autodesk.Revit.DB.InternalDefinition.ParameterGroup
Id of a built-in parameter group to which the parameter defined by this definition belongs.
Remarks:  The parameter group can be changed, but only for parameters that are not built in.
In other words: Modifying the value of this property is only valid for parameter definitions
whose BuiltInParameter property returns BuiltInParameter.INVALID, e.g. Global Parameters.

Autodesk.Revit.DB.InternalDefinition.ParameterType
Returns the user-visible interpretation of the parameter data.
Remarks: The data within the parameter is stored as an integer, double,
string or an element id. To the user these values may be more meaningful as Length, Volume,
Mass etc. This parameter returns the interpretation that should be used for the data.

Autodesk.Revit.DB.InternalDefinition.Name
The user-visible name for the parameter.

Autodesk.Revit.DB.InternalDefinition
This object represents a parameter definition in an Autodesk Revit model.